<?php

namespace Pavel\Slotegrator\Test;

/**
 * ru: Содержит функцию рекурсивной генерации произвольных файлов с произвольным случайным содержимым и папок
 * в указанной директории с учетом следующих параметров: число файлов, максимальная вложенность, максимальная
 * длина имени файла/директории, максимальный размер файла, вероятность (0-100) идентичности содержимого файлов.
 * При 100 - все файлы должны иметь хотя бы одну копию (содержимого), 0 - все файлы разные
 * en
 */
class Generator
{

}
